# Merging DataFrames:

In [1]:
import numpy as np
import pandas as pd

In [2]:
d1=[[1,'Andrew'],[2,'Bob'],[3,'Charlie'],[4,'David']]
c1=['reg_no','name']
df_r=pd.DataFrame(data=d1,columns=c1)
df_r

   reg_no     name
0       1   Andrew
1       2      Bob
2       3  Charlie
3       4    David

In [3]:
d2=[[1,'Xavier'],[2,'Andrew'],[3,'Yolanda'],[4,'Bob']]
c2=['login_no','name']
df_l=pd.DataFrame(data=d2,columns=c2)
df_l

   login_no     name
0         1   Xavier
1         2   Andrew
2         3  Yolanda
3         4      Bob

## Working on inner merge:

In [4]:
pd.merge(df_r,df_l,on='name',how='inner')

   reg_no    name  login_no
0       1  Andrew         2
1       2     Bob         4

## Working on left merge:

In [5]:
pd.merge(left=df_r,right=df_l,on='name',how='left')

   reg_no     name  login_no
0       1   Andrew       2.0
1       2      Bob       4.0
2       3  Charlie       NaN
3       4    David       NaN

## Working on right merge:

In [6]:
pd.merge(left=df_r,right=df_l,on='name',how='right')

   reg_no     name  login_no
0     NaN   Xavier         1
1     1.0   Andrew         2
2     NaN  Yolanda         3
3     2.0      Bob         4

## Working on outer merge:

In [7]:
pd.merge(df_r,df_l,on='name',how='outer')

   reg_no     name  login_no
0     1.0   Andrew       2.0
1     2.0      Bob       4.0
2     3.0  Charlie       NaN
3     4.0    David       NaN
4     NaN   Xavier       1.0
5     NaN  Yolanda       3.0

## Merging DataFrames with index column:

In [8]:
df_r

   reg_no     name
0       1   Andrew
1       2      Bob
2       3  Charlie
3       4    David

In [9]:
df_l

   login_no     name
0         1   Xavier
1         2   Andrew
2         3  Yolanda
3         4      Bob

In [10]:
df_r=df_r.set_index('name')
df_r

         reg_no
name
Andrew        1
Bob           2
Charlie       3
David         4

In [11]:
pd.merge(df_r,df_l,left_index=True,right_on='name',how='inner')

   reg_no  login_no    name
1       1         2  Andrew
3       2         4     Bob

In [12]:
df_r=df_r.reset_index()
df_r

      name  reg_no
0   Andrew       1
1      Bob       2
2  Charlie       3
3    David       4

In [13]:
df_r.columns=['reg_name','reg_no']

In [14]:
df_r

  reg_name  reg_no
0   Andrew       1
1      Bob       2
2  Charlie       3
3    David       4

## Merging different dataframes using different columns (reg_name from df_r and name from df_l):

In [15]:
x1=pd.merge(df_r,df_l,left_on='reg_name',right_on='name',how='inner')
x1

  reg_name  reg_no  login_no    name
0   Andrew       1         2  Andrew
1      Bob       2         4     Bob

In [16]:
x1=x1.drop('reg_name',axis=1)
x1

   reg_no  login_no    name
0       1         2  Andrew
1       2         4     Bob

## Tackling duplicate column names:

In [17]:
df_r

  reg_name  reg_no
0   Andrew       1
1      Bob       2
2  Charlie       3
3    David       4

In [18]:
df_r.columns=['name','id']
df_r

      name  id
0   Andrew   1
1      Bob   2
2  Charlie   3
3    David   4

In [19]:
df_l

   login_no     name
0         1   Xavier
1         2   Andrew
2         3  Yolanda
3         4      Bob

In [20]:
df_l.columns=['id','name']
df_l

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4      Bob

In [21]:
pd.merge(df_r,df_l,on='name',how='inner')

     name  id_x  id_y
0  Andrew     1     2
1     Bob     2     4

In [22]:
pd.merge(df_r,df_l,on='name',suffixes=('_registrations','_logins'))

     name  id_registrations  id_logins
0  Andrew                 1          2
1     Bob                 2          4